tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'macvim-dev/macvim'

cask_args appdir: '/Applications'

brew 'autoconf'
brew 'bash-completion'
brew 'icu4c'
brew 'boost'
brew 'chromedriver'
brew 'cmake'
brew 'cscope'
brew 'ctags'
brew 'libpng'
brew 'freetype'
brew 'gdbm'
brew 'geoip'
brew 'gettext'
brew 'pcre'
brew 'git', args: ['with-brewed-openssl']
brew 'pkg-config'
brew 'readline'
brew 'libyaml'
brew 'openssl'
brew 'ruby'
brew 'heroku-toolbelt'
brew 'libtool'
brew 'htop-osx'
brew 'httpie'
brew 'hub'
brew 'jpeg'
brew 'libtiff'
brew 'imagemagick'
brew 'libevent'
brew 'memcached'
brew 'libmemcached'
brew 'libressl'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'lua'
brew 'macvim'
brew 'mhash'
brew 'mcrypt'
brew 'mercurial'
brew 'mongodb'
brew 'mysql'
brew 'node'
brew 'phantomjs'
brew 'redis'
brew 'selenium-server-standalone'
brew 'sip'
brew 'ssh-copy-id'
brew 'supervisor'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'unixodbc'
brew 'zeromq'
brew 'zsh'
brew 'homebrew/dupes/zlib'
brew 'homebrew/php/igbinary'
brew 'homebrew/php/php56'
brew 'homebrew/php/php-code-sniffer'
brew 'homebrew/php/php56-imagick'
brew 'homebrew/php/php56-intl'
brew 'homebrew/php/php56-mcrypt'
brew 'homebrew/php/php56-mongo'
brew 'homebrew/php/php56-xdebug'
brew 'homebrew/php/php56-zmq'


cask 'font-meslo-for-powerline'
cask 'font-fira-code'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'item2'
cask 'phpstorm'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'telegram'
cask 'ynab'
cask 'sequel-pro'
